@echo off
chcp 65001 >nul

echo d88888b d8888b. .d8888. d888888b d88888b d888888b d8b   db     
echo 88'     88  `8D 88'  YP `~~88~~' 88'       `88'   888o  88     
echo 88ooooo 88oodD' `8bo.      88    88ooooo    88    88V8o 88     
echo 88~~~~~ 88~~~     `Y8b.    88    88~~~~~    88    88 V8o88     
echo 88.     88      db   8D    88    88.       .88.   88  V888     
echo Y88888P 88      `8888Y'    YP    Y88888P Y888888P VP   V8P                                                                    
echo db   db  .d88b.  d8888b. d8888b.  .d88b.  d8888b.              
echo 88   88 .8P  Y8. 88  `8D 88  `8D .8P  Y8. 88  `8D              
echo 88ooo88 88    88 88oobY' 88oobY' 88    88 88oobY'              
echo 88~~~88 88    88 88`8b   88`8b   88    88 88`8b                
echo 88   88 `8b  d8' 88 `88. 88 `88. `8b  d8' 88 `88.              
echo YP   YP  `Y88P'  88   YD 88   YD  `Y88P'  88   YD              


timeout /t 5 /nobreak > null


echo *** Вы оказались у ворот в храм Эпштейна ***
echo Ваши действия:
echo 1) Постучать в ворота
echo 2) Обойти по забору вправо
echo 3) Обойти по забору влево

set /p x=

if "%x%" == "1" (
	echo Вы стучите в ворота и ничего не происходит
	timeout /t 2 /nobreak > null
	echo Вы стучте настойчивее...
	timeout /t 2 /nobreak > null
	echo И тут вам прилетает камнем по бошке!!!
	timeout /t 2 /nobreak > null
	echo *** Плохая концовка!!! ***
	
)

pause



echo   ██           ██████████   ███    █████████████████████████ 
echo       ████████ ███████   ██          ███████████████████████ 
echo  █████████████ ██████   █████████      █████████████████████ 
echo  █████████████ █████ ██ ██████████  ██  ████████████████████ 
echo  █████████████  ████     ██████████ ██  ████████████████████ 
echo            ███  ████ ██ ████████     ██ ████████████████████ 
echo  █              ████████     ██ █ ███  █████████████████████ 
echo  ██████████████ ████  ██   ██ █  ████  █████████████████████ 
echo  ██████████████ ████   ██████  ███████  ████████████████████ 
echo  ██████████████ █████     ████  █   ██   ███████████████████ 
echo  ██████████████ █████   █  ███████  ███  ███████████████████ 
echo  ██████████████ ██████     ██ █ █  █ ██  ███████████████████ 
echo  ██████████████ ███████     █ █████████    █████████████████ 
echo  █████ ████████ ████████     █ ██████      █████████████████ 
echo  ██████████████ ████████    █        █  █   ████████████████ 
echo  ████    ██████ █████         ██████████         ███████████ 
echo  ██        ██████      █████    █████    ██████      ███████ 
echo  █     █    █     ████████████    ██   █████████████   █████ 
echo  █  █ ███      █████████████████  █   ████████████████   ███ 
echo     █  ██ ███████████████████████     █████     ███████   ██ 
echo     ██    ███████████████████████  ██ ████  ███  ████████ ██ 
echo  █     █ ███████████████    █████  █  ████ ██  █  ███████  █ 
echo   █                                                          
